# -*- coding: utf-8 -*-
#-----------------------------------------------------------------------
#	   ___    	 |
#	 _|˚_ |_ 	 |   Language: Python
#	/  ___| \	 |   Version:  2.7
#	\_| ____/	 |   Website:  https://github.com/StasF1/turboCharger
#	  |__˚|  	 |
#-----------------------------------------------------------------------
# Dictionary
#     turbineDict
#
# Description
#     Parameters of the axial turbine
#     РК - рабочее колесо
#     СА - сопловой аппарат
# 
#-----------------------------------------------------------------------

## Exhaust gas parameters
R_Exh         = 286.4 #J/(kg*K), gas constant|газовая постоянная
c_pExh        = 1128.7 #J/(kg*K), isobar heat capacity|изобарная теплоёмкость
k_Exh         = 1.34 #isentropy coefficient|коэф. изоэнтропы
dragInletRatio= 'DEFAULT' #1.01…1.1 (1.017 dflt)|коэф. отношения давления на выходе из турбины к атмосферному давлению

# *****************************************************************************

# Energy conversion efficiency (ECE) & other coefficints|КПД и др. коэф.ы
sigma_esc   = 'DEFAULT' #0.9…0.99 (0.99 dflt)|коэф. утечки (1)
eta_Te      = 'DEFAULT' #0.7…0.85 (0.78 dflt)|КПД турбины (3)
ksi         = 'DEFAULT' #0.5…0.65 (0.56 dflt)|коэф. утечки (5)
rho         = 'DEFAULT' #0.3…0.5 (0.38 dflt)|степень реактивности (6)
phiLosses   = 'DEFAULT' #0.96…0.98 (0.97 dflt)|скоростной коэф. ϕ, учитывающий потери скорости в СА (10)
psiLosses   = 'DEFAULT' #0.92…0.98 (0.95 dflt)|скоростной коэф. ψ, учитывающий потери скорости в РК (30)
c_u1        = 'DEFAULT' #0.85…1.05 (0.95 dflt)|коэф. нагрузки соплового аппарата (27)
c_u2        = 'DEFAULT' #0.8…0.9 (0.85 dflt)|коэф. нагрузки рабочего колеса (50)
eta_m       = 'DEFAULT' #0.92…0.96 (0.94 dflt)|механический КПД (66)

# Geometric parameters|Параметры геометрии
alpha_1     = 'DEFAULT' #deg,14…30 (16 dflt)|угол α_1 наклона вектора абсолютной скорости с_1 (11)
beta_1Blade = 'DEFAULT' #deg,(90 dflt)|угол установки лопаток (16)
alpha_0     = 'DEFAULT' #deg, (90 dflt)|угол входа потока (27) (проверить!)
delta       = 'DEFAULT' #mm, 0.7…1.5 (0.8 dflt)|радиальный зазор Δ между корпусом и РК турбины (38)

# Geometric сoefficients|Коэффициенты геометрии 
RELt1_l1 = 'DEFAULT' #0.8…0.9 (0.88 dflt)|отношение шага решётки соплового аппарата к её высоте (22)
m        = 'DEFAULT' #(1.08 dflt)|коэф. ширины решётки - необходим только при числах Маха 0.4…0.6 (26)
RELt2_l2 = 'DEFAULT' #0.8…0.9 (0.81 dflt)|отношение шага решётки соплового аппарата к её высоте (45)
beta     = 'DEFAULT' #(2 dflt)|опытный коэф., зависящий от типа рабочего колеса (61)

