# -*- coding: utf-8 -*-
#-----------------------------------------------------------------------
#	   ___    	 |
#	 _|˚_ |_ 	 |   Language: Python
#	/  ___| \	 |   Version:  2.7
#	\_| ____/	 |   Website:  https://github.com/StasF1/turboCharger
#	  |__˚|  	 |
#-----------------------------------------------------------------------
# Dictionary
#     turbineDict
#
# Description
#     Parameters of the axial turbine
# 
#-----------------------------------------------------------------------

## Exhaust gas parameters
## ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
R_Exh       = 286.4 # J/(kg*K), gas constant | газовая постоянная
c_pExh      = 1128.7 # J/(kg*K), isobar heat capacity | изобарная теплоёмкость
k_Exh       = 1.34 # isentropy coefficient | коэффициент изоэнтропы
dragInletRatio = "DEFAULT" # 1.01…1.1 (1.017 - default) | коэффициент отношения давления на выходе из турбины к атмосферному давлению


## Turbine parameters
## ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Energy conversion efficiency (ECE) & other coefficints | КПД и др. коэффициенты
eta_Te      = "DEFAULT" # 0…1 (0.8 - default) turbine energy conversion efficiency | КПД турбины (весовой коэффициент) (3)
sigma_esc   = "DEFAULT" # 0.9…0.99 (0.99 - default) | коэффициент утечки (1)
ksi         = "DEFAULT" # 0.5…0.65 (0.56 - default) | коэффициент утечки (5)
rho         = "DEFAULT" # 0.3…0.5 (0.38 - default) | степень реактивности (6)
phiLosses   = "DEFAULT" # 0.96…0.98 (0.97 - default) | скоростной коэффициент ϕ, учитывающий потери скорости в сопловом аппарате (10)
psiLosses   = "DEFAULT" # 0.92…0.98 (0.95 - default) | скоростной коэффициент ψ, учитывающий потери скорости в рабочем колесе (30)
c_u1        = "DEFAULT" # 0.85…1.05 (0.95 - default) | коэффициент нагрузки соплового аппарата (27)
c_u2        = "DEFAULT" # 0.8…0.9 (0.85 - default) | коэффициент нагрузки рабочего колеса (50)
eta_m       = "DEFAULT" # 0.92…0.96 (0.94 - default) | механический КПД (66)

# Geometric parameters
alpha_1     = "DEFAULT" # deg, 14…30 (16 - default) | угол α_1 наклона вектора абсолютной скорости с_1 (11)
beta_1Blade = "DEFAULT" # deg, (90 - default) | угол установки лопаток (16)
RELt1_l1    = "DEFAULT" # 0.8…0.9 (0.88 - default) | отношение шага решётки соплового аппарата к её высоте (22)
m           = "DEFAULT" # (1.08 - default) | коэффициент ширины решётки - необходим только при числах Маха 0.4…0.6 (26)
alpha_0     = "DEFAULT" # deg, (90 - default) | угол входа потока (27) (проверить!)
delta       = "DEFAULT" # mm, 0.7…1.5 (0.8 - default) | радиальный зазор Δ между корпусом и колесом турбины (38)
RELt2_l2    = "DEFAULT" # 0.8…0.9 (0.81 - default) | отношение шага решётки соплового аппарата к её высоте (45)
beta        = "DEFAULT" # (2 - default) | опытный коэффициент, зависящий от типа рабочего колеса (61)









